IDEA StatiCa Open Model
ConnectionPoint Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 ConnectedDesignMemeber
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Connection.ConnectionPoint
 Namespace: IdeaRS.OpenModel.Connection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class ConnectionPoint : OpenElementId
Public Class ConnectionPoint
	Inherits OpenElementId
public ref class ConnectionPoint : public OpenElementId
The ConnectionPoint type exposes the following members.
Constructors
Name | Description
ConnectionPoint
 Constructor
Top
Properties
Name | Description
BearingMember
 Bearing Member
ConnectedMembers
 Connected members as collection of IDs.
Id
 Element Id
 (Inherited from OpenElementId.)
Name
 Name of Element
Node
 Node
NodeId |  Obsolete.
 Id of node
ProjectFileName
 Set filename for Connection
Top
See Also
Reference
IdeaRS.OpenModel.Connection Namespace